# requires gsed, sorry
OVTrainingSetFilter(){
    perl -p -e 's/font-family:\n/font-family: /' \
    | gsed -e '
    s/font-family: *新細明體/ /g
    s/font-family: *微軟..體/ /g
    s/font-family: *華康..體/ /g
    s/font-family:...華康..體/ /g
    s/LY\/繼續開會.html/ /g
    s/\(繼續閱讀\.\.\.\)/ /g
    s/記者...／..報導/ /g
    s/記者..／..報導/ /g
    s/【聯合晚報/ /g
    s/【聯合報/ /g
    s/〔自由時報/ /g
    s/中國時報【/ /g
    s/／..報導/ /g
    s/[‹,›,«,»,〈,〉,《,》,（,）,❨,❩,❮,❯,〔,〕,【,】,〖,〗,❪,❫,❴,❵,❲,❳,❬,❭]/ /g
    s/[﹝,﹞,︼,︻,＜,＞,「,」,“,”,『,』,︽,︾,︷,︸,︵,︶,︿,﹀,〝,〞,‵,′]/ /g
    s/[ʹ,ʺ,ʻ,ʼ,ʽ,ʾ,ʿ,ˀ,ˁ,˂,˃,˄,˅, ̂,ˆ,ˇ,ˈ,ˉ,ˊ,ˋ, ̀,┌,┐]/ /g
    s/[▃,▁,◄,►,▲,▼,▇,▂,▉,█,▌,▋,▎,◤,▍,◢,▏,▆,▄,▅,▊,◣,◥]/ /g
    s/[●,·,•,○,⊙,◎,‧,。,°,﹒,．,˙,◆,□,★,☆,▽,△]/ /g
    s/[↘,╲,➚,←,→,↓,↑,↩,╱,＼,／,∕]/ /g
    s/[ψ,Φ,α,β,ε,λ,μ,π,χ,ω,σ,∑,√,≠,≒,˭,±,²,¾]/ /g
    s/[§,ξ]/ /g
    s/[╰,┴,├,┤,╮,╭,│,┼,┬,╯,╧,╞,═,╪,╡]/ /g
    s/[～,：,；,＠,＃,＄,％,＆,＊,’,﹨,＋,＝]/ /g
    s/[╴,–,−,─,－,—,…,※]/ /g
    s/[︱,ˍ,＿,￣]/ /g
    s/[、,﹑,﹐,，,﹗,！,﹖,?,？,´, ̍,‘]/ /g
    s/[ ,　,,​]/ /g
    s/[\!-~]/ /g
    s/[０,１,２,３,４,５,６,７,８,９]/ /g
    s/[Ａ,Ｂ,Ｃ,Ｄ,Ｅ,Ｆ,Ｇ,Ｈ,Ｉ,Ｊ,Ｋ,Ｌ,Ｍ,Ｎ,Ｏ,Ｐ,Ｑ,Ｒ,Ｓ,Ｔ,Ｕ,Ｖ,Ｗ,Ｘ,Ｙ,Ｚ]/ /g
    s/[ａ,ｂ,ｃ,ｄ,ｅ,ｆ,ｇ,ｈ,ｉ,ｊ,ｋ,ｌ,ｍ,ｎ,ｏ,ｐ,ｑ,ｒ,ｓ,ｔ,ｕ,ｖ,ｗ,ｘ,ｙ,ｚ]/ /g
    s/[À,Á,Â,Ã,Ä,Å,Æ,Ç,È,É,Ê,Ë,Ì,Í,Î,Ï,Ð,Ñ,Ò,Ó,Ô,Õ,Ö,×,Ø,Ù,Ú,Û,Ü,Ý,Þ]/ /g
    s/[à,á,â,ã,ä,å,æ,ç,è,é,ê,ë,ì,í,î,ï,ð,ñ,ò,ó,ô,õ,ö,÷,ø,ù,ú,û,ü,ý,þ]/ /g
    s/[ß,ģ,Ĭ,ĭ,İ,ı,Ĳ,ĳ,Ĵ,ĵ,ō,Ţ,ť,Ũ,Ÿ, ́̈,Β,∧,∪]/ /g
    s/[〃,†,™,∥,⋯,⌘,⑸,♂,♀,,,,,︰,﹔,﹕,￼,�]/ /g
    s/  */ /g;s/^ //g;s/ $//g
    /^$/d;/^ *$/d;/^頁$/d
    s/廣播電臺/廣播電台/g
    s/馬克思/馬克斯/g
    s/臺灣光復/台灣光復/g
' | uniq
}
